#+STARTUP: overview
#+TITLE: Org-mode init.el
#+AUTHOR: Paul Lynch
#+EMAIL: paul@plsys.co.uk
#+OPTIONS: toc:t num:nil
* org-mode
See also http://orgmode.org/orgcard.pdf

Remember: '<s'TAB expands to the source wrapper block, and C-c ' to
open code edit window.  C-c C-c evaluates entire edit buffer.

#+BEGIN_SRC emacs-lisp
  (print "org mode")
    (use-package org-bullets
      :ensure t
      :config
      (add-hook 'org-mode-hook (lambda () (org-bullets-mode))))

    (custom-set-variables
     '(org-directory "~/Dropbox/orgfiles")
     '(org-default-notes-file (concat org-directory "/notes.org"))
     '(org-hide-leading-stars t)
     '(org-startup-folded (quote overview))
     '(org-startup-indented t)
     '(org-export-html-postamble nil))

     (add-hook 'org-mode-hook 'org-indent-mode)

    (setq org-file-apps
          (append '(
                    ("\\.pdf\\'" . "evince %s")) org-file-apps ))

    (global-set-key "\C-c a" 'org-agenda)

    (use-package org-ac
      :ensure t
      :init
      (require 'org-ac)
      (org-ac/config-default))

    (global-set-key (kbd "C-c c") 'org-capture)

    (setq org-agenda-files (list "~/Dropbox/orgfiles/gcal.org"
                                 "~/Dropbox/orgfiles/index.org"))

    (setq org-capture-templates
          '(("t" "To Do Item" entry (file+headline "~/Dropbox/orgfiles/index.org" "To Do")
             "* TODO %?\n%u" :prepend t)
            ("n" "Note" entry (file+headline "~/Dropbox/orgfiles/index.org" "Note space")
             "* %?\n%u" :prepend t)))
#+END_SRC

#+RESULTS:
| t | To Do Item | entry | (file+headline ~/Dropbox/orgfiles/index.org To Do) | * TODO %? |

Add a template for writing emacs-lisp in babel org files
#+Begin_SRC emacs-lisp
  (setq org-src-window-setup 'current-window)
  (add-to-list 'org-structure-template-alist
               '("el" "#+BEGIN_SRC emacs-lisp\n?\n#+END_SRC"))
#+END_SRC

#+RESULTS:
| el | #+BEGIN_SRC emacs-lisp |

